#include <linux/init.h>
#include <linux/module.h>
#include <linux/interrupt.h>
#include <linux/irq.h>
#include <asm/io.h>
#include <linux/dma-mapping.h>
#include <linux/etherdevice.h>
#include <linux/mii.h>
#include <linux/phy.h>
#include <linux/netdevice.h>
#include <asm/setup.h>
#include <linux/genalloc.h>

#include <mach/eth.h>

/*
 * Define this to enable debugging msgs
 */
#undef DEBUG
#define DEBUG

#ifdef DEBUG
#define debug(fmt,args...)	    printk(KERN_DEBUG fmt, ##args)
#else
#define debug(fmt,args...)
#endif	/* DEBUG */
#define info(fmt,args...)       printk(KERN_INFO fmt, ##args)
#define warning(fmt,args...)    printk(KERN_WARNING fmt, ##args)
#define error(fmt,args...)	    printk(KERN_ERR fmt, ##args)

/* dma parameters */
#ifdef MODULE_PARAM_PREFIX
#undef MODULE_PARAM_PREFIX
#endif
#define MODULE_PARAM_PREFIX "stm32429i."

static unsigned int dma_addr = 0x20000000;
module_param(dma_addr, uint, S_IRUGO);
static unsigned int dma_size = 128*1024;
module_param(dma_size, uint, S_IRUGO);
static struct gen_pool *dma_pool;

/* registers description */
struct stm32_mac_regs {
	u32	maccr;          /* 0x0000 *//* Ethernet MAC configuration register */
	u32	macffr;         /* 0x0004 *//* Ethernet MAC frame filter register */
	u32	machthr;        /* 0x0008 *//* Ethernet MAC hash table high register */
	u32	machtlr;        /* 0x000c *//* Ethernet MAC hash table low register */
	u32	macmiiar;       /* 0x0010 *//* Ethernet MAC MII address register */
	u32	macmiidr;       /* 0x0014 *//* Ethernet MAC MII data register */
	u32	macfcr;         /* 0x0018 *//* Ethernet MAC flow control register */
	u32	macvlantr;      /* 0x001c *//* Ethernet MAC VLAN tag register */
	u32	reserved0[(0x0028 - 0x001c) / sizeof(u32) - 1];
	u32	macrwuffr;      /* 0x0028 *//* Ethernet MAC remote wakeup frame filter register */
	u32	macpmtcsr;      /* 0x002c *//* Ethernet MAC PMT control and status register */
	u32	reserved1;
	u32	macdbgr;        /* 0x0034 *//* Ethernet MAC debug register */
	u32	macsr;          /* 0x0038 *//* Ethernet MAC interrupt status register */
	u32	macimr;         /* 0x003c *//* Ethernet MAC interrupt mask register */
	u32	maca0hr;        /* 0x0040 *//* Ethernet MAC address 0 high register */
	u32	maca0lr;        /* 0x0044 *//* Ethernet MAC address 0 low register */
	u32	maca1hr;        /* 0x0048 *//* Ethernet MAC address 1 high register */
	u32	maca1lr;        /* 0x004c *//* Ethernet MAC address 1 low register */
	u32	maca2hr;        /* 0x0050 *//* Ethernet MAC address 2 high register */
	u32	maca2lr;        /* 0x0054 *//* Ethernet MAC address 2 low register */
	u32	maca3hr;        /* 0x0058 *//* Ethernet MAC address 3 high register */
	u32	maca3lr;        /* 0x005c *//* Ethernet MAC address 3 low register */
	u32	reserved2[(0x0100 - 0x005c) / sizeof(u32) - 1];
	u32	mmccr;          /* 0x0100 *//*Ethernet MMC control register */
	u32	mmcrir;         /* 0x0104 *//*Ethernet MMC receive interrupt register */
	u32	mmctir;         /* 0x0108 *//*Ethernet MMC transmit interrupt register */
	u32	mmcrimr;        /* 0x010c *//*Ethernet MMC receive interrupt mask register */
	u32	mmctimr;        /* 0x0110 *//*Ethernet MMC transmit interrupt mask register */
	u32	reserved3[(0x014c - 0x0110) / sizeof(u32) - 1];
	u32	mmctgfsccr;     /* 0x014c *//*Ethernet MMC transmitted good frames after a single collision counter register */
	u32	mmctgfmsccr;    /* 0x0150 *//*Ethernet MMC transmitted good frames after more than a single collisioncounter register */
	u32	reserved4[(0x0168 - 0x0150) / sizeof(u32) - 1];
	u32	mmctgfcr;       /* 0x0168 *//* Ethernet MMC transmitted good frames counter register */
	u32	reserved5[(0x0194 - 0x0168) / sizeof(u32) - 1];
	u32	mmcrfcecr;      /* 0x0194 *//* Ethernet MMC received frames with CRC error counter register */
	u32	mmcrfaecr;      /* 0x0198 *//* Ethernet MMC received frames with alignment error counter register */
	u32	reserved6[(0x01c4 - 0x0198) / sizeof(u32) - 1];
	u32	mmcrgufcr;      /* 0x01c4 *//* MMC received good unicast frames counter register */
	u32	reserved7[(0x0700 - 0x01c4) / sizeof(u32) - 1];
	u32	ptptscr;        /* 0x0700 *//* Ethernet PTP time stamp control register */
	u32	ptpssir;        /* 0x0704 *//* Ethernet PTP subsecond increment register */
	u32	ptptshr;        /* 0x0708 *//* Ethernet PTP time stamp high register */
	u32	ptptslr;        /* 0x070c *//* Ethernet PTP time stamp low register */
	u32	ptptshur;       /* 0x0710 *//* Ethernet PTP time stamp high update register */
	u32	ptptslur;       /* 0x0714 *//* Ethernet PTP time stamp low update register */
	u32	ptptsar;        /* 0x0718 *//* Ethernet PTP time stamp addend register */
	u32	ptptthr;        /* 0x071c *//* Ethernet PTP target time high register */
	u32	ptpttlr;        /* 0x0720 *//* Ethernet PTP target time low register */
	u32	reserved8[(0x0728 - 0x0720) / sizeof(u32) - 1];
	u32	ptptssr;        /* 0x0728 *//* Ethernet PTP time stamp status register */
	u32	ptpppscr;       /* 0x072c *//* Ethernet PTP PPS control register */
	u32	reserved9[(0x1000 - 0x072c) / sizeof(u32) - 1];
	u32	dmabmr;         /* 0x1000 *//* Ethernet DMA bus mode register */
	u32	dmatpdr;        /* 0x1004 *//* Ethernet DMA transmit poll demand register */
	u32	dmarpdr;        /* 0x1008 *//* Ethernet DMA receive poll demand register */
	u32	dmardlar;       /* 0x100c *//* Ethernet DMA receive descriptor list address register */
	u32	dmatdlar;       /* 0x1010 *//* Ethernet DMA transmit descriptor list address register */
	u32	dmasr;          /* 0x1014 *//* Ethernet DMA status register */
	u32	dmaomr;         /* 0x1018 *//* Ethernet DMA operation mode register */
	u32	dmaier;         /* 0x101c *//* Ethernet DMA interrupt enable register */
	u32	dmamfbocr;      /* 0x1020 *//* Ethernet DMA missed frame and buffer overflow counter register */
	u32	dmarswtr;       /* 0x1024 *//* Ethernet DMA receive status watchdog timer register */
	u32	reserved10[(0x1048 - 0x1024) / sizeof(u32) - 1];
	u32	dmachtdr;       /* 0x1048 *//* Ethernet DMA current host transmit descriptor register */
	u32	dmachrdr;       /* 0x104c *//* Ethernet DMA current host receive descriptor register */
	u32	dmachtbar;      /* 0x1050 *//* Ethernet DMA current host transmit buffer address register */
	u32	dmachrbar;      /* 0x1054 *//* Ethernet DMA current host receive buffer address register */
};

/* dma transmit buffer descriptor bits */
#define STM32_DMA_TBD_DMA_OWN   (1 << 31)	/* buffer ownership */
#define STM32_DMA_TBD_DMA_IC    (1 << 30)	/* generate interrupt on completion */
#define STM32_DMA_TBD_LS        (1 << 29)	/* last segment */
#define STM32_DMA_TBD_FS        (1 << 28)	/* first segment */
#define STM32_DMA_TBD_TCH       (1 << 20)	/* chain mode */
#define STM32_DMA_TBD_ES        (1 << 15)	/* Error summary */
#define STM32_DMA_TBD_NC        (1 << 10)	/* No carrier */
#define STM32_DMA_TBD_EC        (1 << 8)	/* Excessive collision*/
#define STM32_DMA_TBD_CC_BIT    3		    /* Collistion count */
#define STM32_DMA_TBD_CC_MSK    0xF
#define STM32_DMA_TBD_UF        (1 << 1)	/* Underflow */

/* DMA receive buffer descriptor bits */
#define STM32_DMA_RBD_DMA_OWN   (1 << 31)	/* buffer ownership */
#define STM32_DMA_RBD_FL_BIT    16		    /* Frame length	      */
